narmesk/testjules1/XIAO_ESP32C3_WebServer/XIAO_ESP32C3_WebServer.ino
#include <WiFi.h>
#include "ESPAsyncWebServer.h"
#include <LittleFS.h>
#include <ArduinoJson.h>
#include <HTTPClient.h>
#include "driver/uart.h"
#include <WiFiClientSecure.h>

#define RXD2 20
#define TXD2 21

unsigned long currentTime = millis();
unsigned long cTime_wificonnect = millis(); //wifi status check
unsigned long cTime_serverpool = millis(); //Server Pool
unsigned long cTime_restartnormal = millis(); //Restart Normal
unsigned long cTime_modbuschecksend = millis(); //Restart Normal
unsigned long intv_wificonnect = 60000; //wifi status check
unsigned long intv_serverpool = 60000; //Server Pool 60000=60seconds
unsigned long intv_restartnormal = 3600000; //Restart Normal , one hour
unsigned long intv_modbuschecksend = 60000; //modbus Pool 60000=60seconds

String prices = "";

String price_arr[24]={"0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0"};
int priceupdatefinish=0;
String transmitpacket = "";//"0350303111222333444555666777888999103215456170003";
String receivepacket = "";//"011000000000000000000000O";
String receivepacket_before = "000000000000000000000000N";//FOR SERVER SEND RECEİVEPACKET
String receivepacket2 = "";
String pmaster="";//FOR SERVER SEND RECEİVEPACKET
String pid="";//FOR SERVER SEND RECEİVEPACKET
String ptype="";//FOR SERVER SEND RECEİVEPACKET
String parameters[48] ;
//String espsettings[] ;
String sid=""; //gstationid
String devprod="d"; //d or p - Loglar için 'd' (debug) olarak ayarlandı
String logs ="";
String mode_apsta ="apsta"; //ap:only AP, apsta:both AP and STA
String ap_ssid_buff_def= "Ledovate-Price-Change";
String ap_password_buff_def= "123456789";
int wifi_fail_try = 0;

String msg_str;

uint8_t wifiretries=0;
uint8_t wifimaxretries=3;
uint8_t ap_maxconnections=2;//Maximum Connection Limit for AP
int ap_currentstations=0, ap_newstations=0;

typedef struct espsettings_kv_ {
   String key;
   String value;
} espsettings_kv_t;

espsettings_kv_t espsettings[] = {
   {"", ""},{"", ""},{"", ""},{"", ""},{"", ""},{"", ""},{"", ""},{"", ""},{"", ""},{"", ""},{"", ""},{"", ""}
};
String espsettings_sid = ""; //settingsde degişen sid , lokalde var sadece

const char *PARAM_leds[] = {"led1", "led2", "led3", "led4", "led5", "led6", "led7", "led8","led9", "led10", "led11", "led12", "led13", "led14", "led15", "led16", "brightness","speed"};
const char *PARAM_params[] = {"ledparam1", "ledparam2", "ledparam3", "ledparam4", "ledparam5", "ledparam6", "ledparam7", "ledparam8","ledparam9", "ledparam10", "ledparam11", "ledparam12", "ledparam13", "ledparam14", "ledparam15", "ledparam16","ledparam17", "ledparam18", "ledparam19", "ledparam20", "ledparam21", "ledparam22", "ledparam23", "ledparam24","ledparam25", "ledparam26", "ledparam27", "ledparam28", "ledparam29", "ledparam30", "ledparam31", "ledparam32","ledparam33", "ledparam34", "ledparam35", "ledparam36", "ledparam37", "ledparam38", "ledparam39", "ledparam40","ledparam41", "ledparam42", "ledparam43", "ledparam44", "ledparam45", "ledparam46", "ledparam47", "ledparam48"};

String serverName = "https://www.ledobe.com/app/";
String serverName_process = serverName+"process.php";
String serverName_pool = serverName+"cfg/ppool/";
String serverName_ledcfg = serverName+"cfg/ledcfg/";
String serverName_pres = serverName+"cfg/pres/";
String serverName_poolp = "";

String poolres = "";
String cfjres = "";

unsigned int flag1 = 0;
int incomingByte;      // a variable to read incoming serial data into

String modbus_function="16";
String modbus_startingaddr="0";
String modbus_startingnum="0";
String modbus_quantity="24";
String modbus_bytecount="48";
String pt_quantity="0";
String pt_startingaddr="0";
String waitForReply="";
int serialtrynum=3; // in "a" phase do 3 times
int serialtrynum_cur= 0;
char modbusPTres[24];//MAX PT yaptım buraya, değişir mi ?
char modbustask = 'x'; //x finished or not started, s started, f esp send itself, r send with stable RP, t send with PT RP
byte serialbufferarr[57];
char is_modbus_hmi = 'm'; //h hmi, m modbus
char change_source = 'a'; //l localnetwork, a accesspoint, s server //where change occured but a and  l same now

// Create AsyncWebServer object on port 80
AsyncWebServer server(80);

#define highByte(x) ( (x) >> (8) ) // keep upper 8 bits
#define lowByte(x) ( (x) & (0xff) ) // keep lower 8 bits

String processor(const String& var){
  return String();
}

/*
 * WiFiEvent_t için not: ESP32 Core 3.x sürümünde imza değişmiş olabilir.
 * Eğer derleme hatası alırsanız 'WiFiEvent_t event, WiFiEventInfo_t info' şeklinde güncelleyin.
 */
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
void OnWiFiEvent(WiFiEvent_t event, WiFiEventInfo_t info){
#else
void OnWiFiEvent(WiFiEvent_t event){
#endif
     //Serial.printf("WiFi-event - %d : ",event);
      serverlog("WiFi-event - ","");
      serverlog((String)event,"");
      serverlog(": ","");

  switch (event) {
     case 0:
      serverlog("WIFI_READY,0,ESP32 wifi ready","ln");
      break;
    case 10:
      serverlog("AP_START,10,AP Started","ln");
      break;
    case 12:
      serverlog("AP_STACONNECTED,12,AP Station Connected","ln");
      break;
    case 14:
      serverlog("AP_STAIPASSIGNED,14,AP Station IP Assigned","ln");
      break;
     case 13:
      serverlog("AP_STADISCONNECTED,13,AP Station Disconnected","ln");
      break;
    default:
      serverlog("otherevent","ln");
    break;
  }/**/
}

String StringDeleteChar(String words, char no){
    char c;
    //char no = '.'; //character I want removed.
    for (int i=0; i<words.length();++i){
        c = words.charAt(i);
        if(c==no){
            words.remove(i, 1);
        }
    }
    return words;
}

String LedPrepareResult(String type="res"){
    if(is_modbus_hmi=='m'){
		String receivepacket_wanted = "";
		receivepacket = "";
		 for(int i = 0; i < 24; i++)
		{
			receivepacket += modbusPTres[i];
			receivepacket_wanted += '1';

		}

    if (receivepacket.substring(0,parameters[2].toInt()) == receivepacket_wanted.substring(0,parameters[2].toInt()))
			receivepacket += 'O';
	else
			receivepacket += 'N';

