narmesk/testjules1/XIAO_ESP32C3_WebServer/XIAO_ESP32C3_WebServer.ino
	}
  //receivepacket="110000000000000000000000O\n";
  String receivepacketfilter = "";
  receivepacketfilter = receivepacket;
  receivepacketfilter.trim();
  receivepacketfilter=receivepacketfilter.substring(receivepacketfilter.length()-25);
  serverlog("filtered:","ln");
  serverlog(receivepacketfilter,"");

String msg="{\"res\":\""+receivepacketfilter+"\"}";
    //msg = "{\"35\":\"csrok\"}";
   //msg+="{";

/*
for (int i = 0; i < receivepacket.length(); i++) {
  if (receivepacket.substring(i, i+1) == "1") {
       msg+="\""+(i+1)+"\":\"";
  }
}
 */
    if(type=="res")
     return msg;
    else if(type=="trim")
     return receivepacketfilter;
}

int FileWriteF(String txt, String path){

 File file = LittleFS.open(path, FILE_WRITE);
  if(!file){
    serverlog("Failed to open file for writing","ln");
    //return "";
  }

  int bytesWritten = file.print(txt);

  if (bytesWritten > 0) {
    serverlog("ledconfig.json written success:","");
    serverlog((String)bytesWritten,"ln");
  } else {
    serverlog("ledconfig.json write failed","ln");
  }

  file.close();

  return bytesWritten;
}

String WriteLedConfig(const String proct){

/**/
File file = LittleFS.open("/ledconfig.json", "r");
  if(!file){
    serverlog("Failed to open ledconfig.json for reading","ln");
    //return "";
  }

String ledconfigstr;

  serverlog("ledconfig.json Read Success","ln");
  while(file.available()){
    //Serial.write(file.read());
    ledconfigstr+=String((char)file.read());
  }
  //Serial.println(ledconfigstr);
file.close();

JsonDocument doc;
 //char json[] ="{\"sensor\":\"gps\",\"time\":1351824120,\"data\":[48.756080,2.302038]}";
// Deserialize the JSON document
  DeserializationError error = deserializeJson(doc, ledconfigstr);
 // Test if parsing succeeds.
  if (error) {
    serverlog("deserializeJson() failed: ","");
    serverlog(error.f_str(),"ln");
    return "";
  }


//Station ID ve serverpool url hazırla
const char* gstationidc = doc["sid"] | "";
sid = gstationidc;
serverName_poolp =  serverName_pool + sid + ".json";

//server send receivepacket için
const char* pidc = doc["pid"] | "";
pid = pidc;
const char* ptypec = doc["ptype"] | "";
ptype = ptypec;
const char* pmasterc = doc["pmaster"] | "";
pmaster = pmasterc;

//const char* sensor = doc["leds"][0]["t"];
//Serial.println(sensor);
//Serial.println(doc.memoryUsage());  // 10 on AVR

if(proct == "p"){
   doc["ptype"]="pr";

/*
int m=0;
for (int i = 0; i < prices.length(); i++) {
  if (prices.substring(i, i+1) == ":") {
    //firstVal = input.substring(0, i).toInt();
     //Serial.println(prices.substring(i-4, i));
     doc["leds"][m]["v"]=prices.substring(i-4, i);
     m++;
    //break;
  }
}*/
for (int i = 0; i < 24; i++) {
     doc["leds"][i]["v"]=price_arr[i];
}
}
else if(proct=="m"){
     doc["ptype"]="pm";

  for (int z = 0; z < 48; z++) {
     doc["parameters"][z]["v"]=parameters[z];
    //break;
  }
}

else if(proct=="s"){
     doc["ptype"]="st";
     doc["sid"] = espsettings_sid;
for (int x = 0; x <= 11; x++) { //Serial.println(x);Serial.println(espsettings[x].key.c_str());
  if(espsettings[x].key!="")
    doc["esp32sett"][espsettings[x].key]=espsettings[x].value;
  }
}

if(proct == "p" || proct == "m" || proct == "s"){
   doc["pdate"]="";
   doc["pmaster"]="ln";
   doc["pid"]=random(11111111,99999999);
}

//doc["gstationid"]="2";
//doc.garbageCollect();
//Serial.println(doc.memoryUsage()); // 21

ledconfigstr="";
serializeJson(doc, ledconfigstr);
//Serial.println(ledconfigstr);

const char* vtmp="";
for(int i=0;i<48;i++)
  {
    vtmp = doc["parameters"][i]["v"];
      parameters[i]=vtmp;
  }

int x=0;
JsonObject root = doc["esp32sett"].as<JsonObject>();

    for (auto kv : root) {
      espsettings[x].key = kv.key().c_str();
      espsettings[x].value = kv.value().as<String>();
      x+=1;
      if(x >= 12) break; // Dizi sınırını koru
    }
devprod =  getvfrom_espsettings("devprod");

//IF ONLY READ OR SERVER RELATED CALL
if(proct == "x"){
	        //prices="";
const char* vtmp1="";
for(int i=0;i<24;i++)
  {
    vtmp1 = doc["leds"][i]["v"] | "0";
//prices+=String(vtmp1)+":";
           price_arr[i]=String(vtmp1);
  }

}
//IF SETTINGS, PARAMETERS, PICAES CHANGED
if(proct != "x"){

FileWriteF(ledconfigstr,"/ledconfig.json");

  //IF SETTINGS, PARAMETERS, PICAES CHANGED SEND CFJ TO SERVER
    String serverName_process2 = serverName_process + "?savecfj=t&sid=" + sid;
   sendhttp(ledconfigstr, "httpjson", serverName_process2);
}

    return "";

}

String SendSerialProcStart(){
  transmitpacket = "";
  int ledcount=36;
  String lastpart="170003";
  String pricedelm="";
  String paramdelm="";
  int priceleftc = 0;
  int priceleftctot = 36;

  //"0350303111222333444555666777888999103215456170003";
//035 03 03 -111 222-333  444-555 666-777 888-999  103-215 456-170-003
String prices = "";
for (int i = 0; i < 12; i++) {
     prices+=price_arr[i];
}

pricedelm = StringDeleteChar(prices, '.');    //Serial.println(pricedelm);
pricedelm = StringDeleteChar(pricedelm, ':');

priceleftc=priceleftctot-pricedelm.length();
for(int i=0;i<priceleftc;i++)
  pricedelm+="0";

if(parameters[1].length()==1)
  paramdelm="00"+parameters[1];
else if(parameters[1].length()==2)
    paramdelm="0"+parameters[1];
transmitpacket+=paramdelm;

if(parameters[2].length()==1)
  paramdelm="0"+parameters[2];
else
  paramdelm=parameters[2];
transmitpacket+=paramdelm;

if(parameters[5].length()==1)
  paramdelm="0"+parameters[5];
else
  paramdelm=parameters[5];
transmitpacket+=paramdelm;

//transmitpacket+=parameters[1];
//transmitpacket+=parameters[2];
//transmitpacket+=parameters[5];
 transmitpacket += pricedelm;
 transmitpacket+=lastpart;

    serverlog(transmitpacket,"ln");

  flag1=1;

return "";
}

void serverlog(String msg, String ln){
  if(devprod=="d" || devprod=="D"){
    if(ln=="ln")
      Serial.println(msg);
    else if(ln=="")
      Serial.print(msg);
  }

  else if(devprod=="p" || devprod=="P"){

  }
}

String getvfrom_espsettings(String key1){
   for (int x = 0; x < sizeof(espsettings)/sizeof(espsettings[0]); x++) {
    if (key1 == espsettings[x].key) {
     return espsettings[x].value;
    }
  }
  return "";
}

void esprestart(){
  serverlog("Restarting in 2 seconds","ln");
  delay(2000);
  ESP.restart();
}

void initap(){

	if(WiFi.status()!= WL_CONNECTED){

