narmesk/testjules1/XIAO_ESP32C3_WebServer/XIAO_ESP32C3_WebServer.ino
   // WiFi.disconnect(); // Do not disconnect, we might be in AP_STA mode
  WiFi.mode(WIFI_AP_STA);
  /*-----------WIFI not connected so try AP---------*/

    if(WiFi.status() != WL_CONNECTED)
	{

  String ap_ssid_buff="";
  String ap_password_buff="";

  if(getvfrom_espsettings("apid")==""){
     ap_ssid_buff= ap_ssid_buff_def;
     ap_password_buff= ap_password_buff_def;
  }
  else{
    ap_ssid_buff=getvfrom_espsettings("apid");
    ap_password_buff=getvfrom_espsettings("appw");
  }

    char ap_ssid[ap_ssid_buff.length()+1];
    ap_ssid_buff.toCharArray(ap_ssid, ap_ssid_buff.length()+1);

    char ap_password[ap_password_buff.length()+1];
    ap_password_buff.toCharArray(ap_password, ap_password_buff.length()+1);


    serverlog("Setting AP ","ln");
    //WiFi.mode(WIFI_AP);

    //Setting the AP Mode with SSID, Password, and Max Connection Limit
    if(WiFi.softAP(ap_ssid,ap_password,1,false,ap_maxconnections)==true)
    {
    delay(100);//seems like this delay is quite important.

    IPAddress Ip(7, 3, 2, 1);
    IPAddress NMask(255, 255, 255, 0);
    WiFi.softAPConfig(Ip, Ip, NMask);

    serverlog("AP: ","");
    serverlog(ap_ssid,"");
    serverlog(" : ","");
    serverlog((String)WiFi.softAPIP().toString().c_str(),"ln");

    /*
    Serial.println(ap_ssid_buff);
    Serial.println(ap_password_buff);
    Serial.println(ap_ssid);
    Serial.println(ap_password);

    IPAddress IP = WiFi.softAPIP();
    Serial.print("AP IP address: ");
    Serial.println(IP);

    // Print ESP8266 Local IP Address
    //Serial.println(WiFi.localIP());
    */

    }
    else
    {
    delay(100);//seems like this delay is quite important.
     serverlog("Unable to Create Access Point","ln");
    }


    }

}
}

void initwifi(){


	if(mode_apsta=="apsta"){

  WiFi.mode(WIFI_AP_STA);

  /*-----------WIFI connect try first----------*/

    String wifi_ssid_buff="";
    String wifi_password_buff="";
    wifi_ssid_buff=getvfrom_espsettings("wifiid");
    wifi_password_buff=getvfrom_espsettings("wifipw");

    if(wifi_ssid_buff!="" && wifi_password_buff!=""){

    //WiFi.softAPdisconnect();

    char wifi_ssid[wifi_ssid_buff.length()+1];
    wifi_ssid_buff.toCharArray(wifi_ssid, wifi_ssid_buff.length()+1);

    char wifi_password[wifi_password_buff.length()+1];
    wifi_password_buff.toCharArray(wifi_password, wifi_password_buff.length()+1);



    WiFi.begin(wifi_ssid, wifi_password);

    serverlog("Connecting to ","");
    serverlog(wifi_ssid,"ln");

  while(WiFi.status()!=WL_CONNECTED && wifiretries<wifimaxretries)
    {
    serverlog(".","");
    wifiretries++;
    delay(1000);
    }

    /*//Inform the user whether the timeout has occured, or the ESP8266 is connected to the internet
    if(wifiretries==wifimaxretries)//Timeout has occured
    {
    serverlog("Unable to Connect to ","");
    serverlog(wifi_ssid,"ln");
	//initap();
    }*/

    if(WiFi.status()==WL_CONNECTED)//WiFi has succesfully Connected
    {
    // Connected to WiFi
    serverlog("","ln");
    serverlog("Connected!","ln");
    serverlog("IP address for localnetwork ","");
    serverlog(wifi_ssid,"");
    serverlog(" : ","");
    serverlog(WiFi.localIP().toString().c_str(),"ln");
    serverlog("wifi rssi:","");
    serverlog((String)WiFi.RSSI(),"ln");
	wifi_fail_try = 0;
	  WiFi.softAPdisconnect();
    }
    else{
		serverlog("Unable to Connect to ","");
		serverlog(wifi_ssid,"ln");
	}

  wifiretries = 0;

   }


}
}

String sendhttp(String httpRequestData, String httpType, String serverPath){

	if(WiFi.status()== WL_CONNECTED && mode_apsta=="apsta"){
      /**/
      HTTPClient http;

      //String serverPath = serverName + "?sid=1";

      // Your Domain name with URL path or IP address with path
      http.begin(serverPath.c_str());
      int httpResponseCode = 0;
        String payload = "{}";
      // Send HTTP GET request
      if (httpType=="httpget")
       httpResponseCode = http.GET();
      else if (httpType=="httppost")
      {
       http.addHeader("Content-Type", "application/x-www-form-urlencoded");
      //String httpRequestData = "api_key=tPmAT5Ab3j7F9&sensor=BME280&value1=24.25&value2=49.54&value3=1005.14";
       httpResponseCode = http.POST(httpRequestData);
      }
      else if (httpType=="httpjson")
      {
       http.addHeader("Content-Type", "application/json");
      //int httpResponseCode = http.POST("{\"api_key\":\"tPmAT5Ab3j7F9\",\"sensor\":\"BME280\",\"value1\":\"24.25\",\"value2\":\"49.54\",\"value3\":\"1005.14\"}");
       httpResponseCode = http.POST(httpRequestData);

      }


      if (httpResponseCode>0) {
        serverlog("HTTP Response code: ","");
        serverlog((String)httpResponseCode,"ln");
        payload = http.getString();
        serverlog(payload,"ln");
      }
      else {
        serverlog("Error code: ","");
        serverlog((String)httpResponseCode,"ln");
      }
      // Free resources
      http.end();

  return payload;
}
else{
	return "";
}
}

String checkncfj(){
  //cfjres="{}";
  if (cfjres.substring(0,8) == "{\"pdate\""){
    serverlog("cfj download success","ln");
    return "1";
  }
  return "0";
}

//SEND receivepacket TO SERVER--------------------------------------------
void receivepacketsend(){
  String receivepacket_trim = LedPrepareResult("trim");
  String receivepacket_res = LedPrepareResult("res");

   serverlog("receivepacket:"+receivepacket_trim+"  receivepacket_before:"+receivepacket_before,"ln");
  if(pmaster=="sv" && receivepacket_before!=receivepacket_trim){
    cfjres = "";
    String serverName_process1 = serverName_process + "?procres="+receivepacket_trim+"&pid=" + pid;
    cfjres = sendhttp(receivepacket_res, "httpjson", serverName_process1);
    receivepacket_before = receivepacket_trim;
     serverlog("receivepacketsend success","ln");
  }

}


void initserver(){

  // Route for root / web page
  server.on("/", HTTP_GET, [](AsyncWebServerRequest *request){
    serverlog("HTTP_GET /","ln");
    if(LittleFS.exists("/index.html"))
      request->send(LittleFS, "/index.html", String(), false, processor);
    else
      request->send(404, "text/plain", "Hata: /index.html LittleFS icinde bulunamadi! Lutfen 'Data Upload' yaptiginizdan emin olun.");
  });

  server.on("/parameters", HTTP_GET, [](AsyncWebServerRequest *request){
    serverlog("HTTP_GET /parameters","ln");
    if(LittleFS.exists("/parameters.html"))
      request->send(LittleFS, "/parameters.html", String(), false, processor);
    else
      request->send(404, "text/plain", "Hata: /parameters.html bulunamadi.");
  });

  server.on("/settings", HTTP_GET, [](AsyncWebServerRequest *request){
    serverlog("HTTP_GET /settings","ln");
    if(LittleFS.exists("/settings.html"))
      request->send(LittleFS, "/settings.html", String(), false, processor);
    else
      request->send(404, "text/plain", "Hata: /settings.html bulunamadi.");
  });

  // Route to load style.css file
  server.on("/style.css", HTTP_GET, [](AsyncWebServerRequest *request){
    serverlog("HTTP_GET /style.css","ln");
    if(LittleFS.exists("/style.css"))
      request->send(LittleFS, "/style.css", "text/css");
    else
      request->send(404, "text/plain", "Hata: /style.css bulunamadi.");
  });

    // Route to load style.css file
  server.on("/js.js", HTTP_GET, [](AsyncWebServerRequest *request){
    serverlog("HTTP_GET /js.js","ln");
    if(LittleFS.exists("/js.js"))
      request->send(LittleFS, "/js.js", "text/javascript");
    else
      request->send(404, "text/plain", "Hata: /js.js bulunamadi.");
  });

    // Route to load style.css file
  server.on("/getledconfig", HTTP_GET, [](AsyncWebServerRequest *request){
    serverlog("HTTP_GET /getledconfig","ln");
    if(LittleFS.exists("/ledconfig.json"))
      request->send(LittleFS, "/ledconfig.json", "text/plain");
    else
      request->send(404, "text/plain", "Hata: /ledconfig.json bulunamadi.");
  });

    // Send a POST request to <IP>/post with a form field message set to <message>
    server.on("/sendparam", HTTP_POST, [](AsyncWebServerRequest *request){
          serverlog("HTTP_POST /sendparam","ln");
        String param = "";
        if (request->hasParam(PARAM_params[0], true)) {
          for(int i=0;i<48;i++)
            {
              parameters[i] = request->getParam(PARAM_params[i], true)->value();
              serverlog(parameters[i],"");
            }
        serverlog("","ln");

			change_source ='a'; //change made from AP
            WriteLedConfig(String("m"));
            //SendSerialProcStart();

            //Serial.println(parameters[0]);

        } else {
            //message = "No message sent";
        }
             //Serial.println("receivedprices:"+prices);

    request->send(200, "text/plain", "{\"res\":\"paramok\"}");
    //request->send(200, "text/plain", "{\"35\":\"csrok\"}");
    });

