narmesk/testjules1/XIAO_ESP32C3_WebServer/XIAO_ESP32C3_WebServer.ino
    //espsettings_arr
    // Send a POST request to <IP>/post with a form field message set to <message>
    server.on("/sendsett", HTTP_POST, [](AsyncWebServerRequest *request){
          serverlog("HTTP_POST /sendsett","ln");

          int paramsNr = request->params();

        if (paramsNr>0) {

          int z=0;
          for(int i=0;i<paramsNr;i++){

               const AsyncWebParameter* p = request->getParam(i);
               serverlog(p->name(),"");
               serverlog(":","");
               serverlog(p->value(),"");
                serverlog("  ","");


           if(p->name()=="gstationid"){
		   }
		   else if(p->name()=="sid"){
			   espsettings_sid = p->value();
		   }
           else{
               espsettings[z].key = p->name();
               espsettings[z].value = p->value();
               z+=1;
          }
          }

/*        Serial.println("x");
for (int x = 0; x <= sizeof(espsettings)/sizeof(espsettings[0]); x++) {
               Serial.print(espsettings[x].key);
               Serial.print(":");
               Serial.println(espsettings[x].value);
  }
*/
        serverlog("","ln");

			change_source ='a'; //change made from AP
           WriteLedConfig(String("s"));
          request->send(200, "text/plain", "{\"res\":\"paramok\"}");
           esprestart();

            //SendSerialProcStart();

            //Serial.println(parameters[0]);
            //prices = StringDeleteChar(prices, '.');

        } else {
                request->send(200, "text/plain", "{\"res\":\"0\"}");
        }
             //Serial.println("receivedprices:"+prices);

    //request->send(200, "text/plain", "{\"35\":\"csrok\"}");
    });

    // Send a POST request to <IP>/post with a form field message set to <message>
    server.on("/sendserial", HTTP_POST, [](AsyncWebServerRequest *request){
        serverlog("HTTP_POST /sendserial","ln");
        //String message;
        String price = "";

        //prices="";
        if (request->hasParam(PARAM_leds[0], true)) {
			for(int i=0; i<18;i++){
			if (request->hasParam(PARAM_leds[i], true))
				price_arr[i] = request->getParam(PARAM_leds[i], true)->value();

			}
           /* price = request->getParam(PARAM_leds[0], true)->value();price_arr[0] = price;//prices+=price+":";
            price = request->getParam(PARAM_leds[1], true)->value();price_arr[1] = price;//prices+=price+":";
            price = request->getParam(PARAM_leds[2], true)->value();price_arr[2] = price;//prices+=price+":";
            price = request->getParam(PARAM_leds[3], true)->value();price_arr[3] = price;//prices+=price+":";
            price = request->getParam(PARAM_leds[4], true)->value();price_arr[4] = price;//prices+=price+":";
            price = request->getParam(PARAM_leds[5], true)->value();price_arr[5] = price;//prices+=price+":";
            price = request->getParam(PARAM_leds[6], true)->value();price_arr[6] = price;//prices+=price+":";
            price = request->getParam(PARAM_leds[7], true)->value();price_arr[7] = price;//prices+=price+":";
            price = request->getParam(PARAM_leds[8], true)->value();price_arr[8] = price;//prices+=price+":";
            price = request->getParam(PARAM_leds[9], true)->value();price_arr[9] = price;//prices+=price+":";
            price = request->getParam(PARAM_leds[10], true)->value();price_arr[10] = price;//prices+=price+":";
            price = request->getParam(PARAM_leds[11], true)->value();price_arr[11] = price;//prices+=price+":";
            price = request->getParam(PARAM_leds[16], true)->value();price_arr[16] = price;//prices+=price+":";
            price = request->getParam(PARAM_leds[17], true)->value();price_arr[17] = price;//prices+=price+":";*/
            WriteLedConfig(String("p"));

			if(is_modbus_hmi=='h')
				SendSerialProcStart();
			else if(is_modbus_hmi=='m')
			    modbustask = 's';

			change_source ='a'; //change made from AP

            //Serial.println(parameters[0]);
            //prices = StringDeleteChar(prices, '.');

        } else {
            //message = "No message sent";
        }
             //Serial.println("receivedprices:"+prices);

    request->send(200, "text/plain", "{\"res\":\"ok\"}");
    //request->send(200, "text/plain", "{\"35\":\"csrok\"}");
    });

   // Send a POST request to <IP>/post with a form field message set to <message>
    server.on("/checkserial", HTTP_GET, [](AsyncWebServerRequest *request){
          serverlog("HTTP_GET /checkserial","");
         String ledmessage = LedPrepareResult();
         serverlog(ledmessage,"ln");

    request->send(200, "text/plain", ledmessage);
    //request->send(200, "text/plain", "{\"35\":\"csrok\"}");
    });

  // Global 404 Handler
  server.onNotFound([](AsyncWebServerRequest *request) {
    String message = "Hata: Sayfa Bulunamadı (404)\n\n";
    message += "URL: " + request->url() + "\n";
    message += "Method: " + String((request->method() == HTTP_GET) ? "GET" : "POST") + "\n";
    request->send(404, "text/plain", message);
  });

  // Start server
  server.begin();

}

//MODBUS CRC16--------------------------------------------
static uint16_t MODBUS_CRC16_v1( const unsigned char *buf, unsigned int len )
{
	uint16_t crc = 0xFFFF;
	unsigned int i = 0;
	char bit = 0;

	for( i = 0; i < len; i++ )
	{
		crc ^= buf[i];

		for( bit = 0; bit < 8; bit++ )
		{
			if( crc & 0x0001 )
			{
				crc >>= 1;
				crc ^= 0xA001;
			}
			else
			{
				crc >>= 1;
			}
		}
	}

	return  (crc>>8) | (crc<<8);
}


/*--------MODBUSTASKSTART--------------------------------------------*/

void ModbusTaskStart(){
	if(modbustask=='s'){ // if started first
		 for(int i = 0; i < 24; i++)
		{
		 modbusPTres[i]='0';
		}
		modbustask = 'f';
	}
	if(modbustask=='f')// ESP SEND SELF
		ModbusTaskSend_Self();
	if(modbustask=='r')// SEND WITH STABLE REPEATER
		ModbusTaskSend_RP();
	if(modbustask=='t')// SEND WITH PT REPEATER
		ModbusTaskSend_RPPT();
}


/*--------MODBUSTASKSTART--------------------------------------------*/

void ModbusTaskSend_Self(){
	ModbusTaskSend();
	if(change_source == 's')
	receivepacketsend();
}

/*--------ModbusTaskSend_RP--------------------------------------------*/

