narmesk/testjules1/XIAO_ESP32C3_WebServer/XIAO_ESP32C3_WebServer.ino
void ModbusTaskSend_RP(){
}

/*--------ModbusTaskSend_RPPT--------------------------------------------*/

void ModbusTaskSend_RPPT(){
}

/*--------ModbusTaskSend_RPPT--------------------------------------------*/

char CheckSerialRes(){
	if(serialbufferarr[0]!=0){ //if first byte is not 0 , continue
		if(serialbufferarr[8]==0){ //if 8. byte is 0 , it is 8 byte
			uint16_t crcr = MODBUS_CRC16_v1(serialbufferarr,sizeof(serialbufferarr)-51);
			//Serial.println(crcr);
			//Serial.println(highByte(crcr),HEX);
			//Serial.println(lowByte(crcr),HEX);
			if(highByte(crcr)==serialbufferarr[6] && lowByte(crcr)==serialbufferarr[7])
				return '1';

		}
		else{ //if 8. byte is not 0 , it is 57 byte
			return 'n';

		}
	}
	return 'n';
}

char  CheckModbusTask(){
 for(int k = 0; k < parameters[2].toInt(); k++){
	 if(modbusPTres[k]!='1'){
		 return '0';
	 }

 }
		modbustask = 'x';
		return '1';

}

/*--------MODBUSTASKSEND---------------------------------------------------*/

String ModbusTaskSend(){

	//modbus routine started

//byte CardNumber[]={0x24,0x10,0x00,0x00,0x00,0x18,0x30,0x03,0x09,0x03,0x78,0x00,0x6f,0x00,0xde,0x01,0x4d,0x01,0xbc,0x02,0x2b,0x02,0x9a,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x08,0x34,0x00,0x09,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x46,0xf8,0xff};
pt_startingaddr=parameters[1];
pt_quantity=parameters[2];  //Serial.println(pt_quantity);
//pt_quantity=1;

//String waitForReply="";
//String serialtrynum="";
unsigned char vals[58];
byte  valsbyte[58];
int rowb=0;

String price_arr2[24]={"0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0"};
for (int i = 0; i < 24; i++) {
     price_arr2[i]=StringDeleteChar(price_arr[i], '.');
}

 for(int i = 0; i < 58; i++)
{
 valsbyte[i]=0;
}

for(int tryn=0;tryn<serialtrynum;tryn++)
for(int m=0;m<pt_quantity.toInt();m++)
	if(modbusPTres[m]=='0') //if not ok
{
	rowb=0;

msg_str = "SerialTry: " + String(tryn+1) + "-" + String(m+1);
serverlog(msg_str,"ln");

valsbyte[rowb++]=(pt_startingaddr.toInt())+m;//CardNumber[0]=(pt_startingaddr.toInt())+m;
valsbyte[rowb++]=modbus_function.toInt();
valsbyte[rowb++]=0;
valsbyte[rowb++]=modbus_startingaddr.toInt();
valsbyte[rowb++]=0;
valsbyte[rowb++]=modbus_quantity.toInt();
valsbyte[rowb++]=modbus_bytecount.toInt();


  //transmitpacket = "";
  //int ledcount=36;
  //String lastpart="170003";
  //String pricedelm="";
  //String paramdelm="";
  //int priceleftc = 0;
  //int priceleftctot = 36;

  //"0350303111222333444555666777888999103215456170003";
//035 03 03 -111 222-333  444-555 666-777 888-999  103-215 456-170-003

//pricedelm = StringDeleteChar(prices, '.');    Serial.println(pricedelm); //111:222:333:444:555:666:777:888:
//pricedelm = StringDeleteChar(pricedelm, ':');
//pricedelm = pricedelm.substring(0, pricedelm.length() - 1); //Serial.println(pricedelm);


/*
int a=0;
for (int i = 0; i < pricedelm.length(); i++) {
  if (pricedelm.substring(i, i+1) == ":") {
    //firstVal = input.substring(0, i).toInt();
     //Serial.println(prices.substring(i-4, i));
     price_arr[a]=pricedelm.substring(i-3, i);Serial.println(price_arr[a]);
     a++;
    //break;
  }
}  */



valsbyte[rowb++]=highByte(price_arr2[6].toInt());
valsbyte[rowb++]=lowByte(price_arr2[6].toInt());
valsbyte[rowb++]=highByte(price_arr2[7].toInt());
valsbyte[rowb++]=lowByte(price_arr2[7].toInt());
valsbyte[rowb++]=highByte(price_arr2[0].toInt());
valsbyte[rowb++]=lowByte(price_arr2[0].toInt());
valsbyte[rowb++]=highByte(price_arr2[1].toInt());
valsbyte[rowb++]=lowByte(price_arr2[1].toInt());
valsbyte[rowb++]=highByte(price_arr2[2].toInt());
valsbyte[rowb++]=lowByte(price_arr2[2].toInt());
valsbyte[rowb++]=highByte(price_arr2[3].toInt());
valsbyte[rowb++]=lowByte(price_arr2[3].toInt());
valsbyte[rowb++]=highByte(price_arr2[4].toInt());
valsbyte[rowb++]=lowByte(price_arr2[4].toInt());
valsbyte[rowb++]=highByte(price_arr2[5].toInt());
valsbyte[rowb++]=lowByte(price_arr2[5].toInt());
valsbyte[rowb++]=highByte(price_arr2[8].toInt());
valsbyte[rowb++]=lowByte(price_arr2[8].toInt());
valsbyte[rowb++]=highByte(price_arr2[9].toInt());
valsbyte[rowb++]=lowByte(price_arr2[9].toInt());
valsbyte[rowb++]=highByte(price_arr2[10].toInt());
valsbyte[rowb++]=lowByte(price_arr2[10].toInt());
valsbyte[rowb++]=highByte(price_arr2[11].toInt());
valsbyte[rowb++]=lowByte(price_arr2[11].toInt());

valsbyte[rowb++]=0;
valsbyte[rowb++]=0;
valsbyte[rowb++]=0;
valsbyte[rowb++]=0;

valsbyte[rowb++]=highByte((((price_arr[17].toInt())-1)*200)+700);
valsbyte[rowb++]=lowByte((((price_arr[17].toInt())-1)*200)+700);
valsbyte[rowb++]=highByte((price_arr[16].toInt())-1);
valsbyte[rowb++]=lowByte((price_arr[16].toInt())-1);

uint16_t crcr = MODBUS_CRC16_v1(valsbyte,sizeof(valsbyte)-3);

valsbyte[55]=highByte(crcr);
valsbyte[56]=lowByte(crcr);
valsbyte[57]=0xff;

//Serial.println(MODBUS_CRC16_v1(valsbyte,STR_LEN-3), HEX);
    //serverlog(transmitpacket,"ln");

 msg_str ="";
 for(int k = 0; k < 58; k++)
{
	msg_str+=String(valsbyte[k], HEX) + "-";
// Serial.print(valsbyte[k],HEX);
 //Serial.print("-");
}
 //Serial.println("");
 serverlog(msg_str,"ln");

/*  for(int k = 0; k < 58; k++)
{
 Serial.print(CardNumber[k],HEX);
 Serial.print("-");
}
 Serial.println("");
*/

Serial1.write(valsbyte, 58);

delay(170); //100ms is not enough

ReadSerialBuffer();

 msg_str ="";
 for(int k = 0; k < 57; k++)
		msg_str+=String(serialbufferarr[k], HEX) + "-";
  serverlog(msg_str,"ln");


if(CheckSerialRes()=='1'){
		modbusPTres[m]='1';
}

 msg_str ="";
 for(int k = 0; k < 24; k++)
		msg_str+=String(modbusPTres[k]) + "-";
  serverlog(msg_str,"ln");

}

CheckModbusTask();
	//modbustask = 'x';


return "";
}


/*--------ReadSerialBuffer-------------------*/

void ReadSerialBuffer(){

 for(int k = 0; k < 57; k++)
{
  serialbufferarr[k] = 0;

}

int i=0;

  if (Serial1.available()){
   while (Serial1.available() > 0)
  {
       //serverlog("  hmic:","");
       //serverlog((String)Serial1.available(),"");
    // get the new byte:
    int inChar = (int)Serial1.read();
	  //Serial.println(inChar,HEX);
	  serialbufferarr[i] = inChar;
	  i++;
	  if(i==56) break;


