narmesk/testjules1/XIAO_ESP32C3_WebServer/XIAO_ESP32C3_WebServer.ino
  }

         //serverlog("receivepacketwoutfilter:","");
         //serverlog(receivepacket,"ln");
		 //receivepacketsend();
  }


}

//MODBUS TEST--------------------------------------------
String modbustest(){
	     serverlog("sendingserialtest:","ln");
		   const unsigned char dt[] = {0x24,0x10,0x00,0x00,0x00,0x18,0x30,0x03,0x09,0x03,0x78,0x00,0x6f,0x00,0xde,0x01,0x4d,0x01,0xbc,0x02,0x2b,0x02,0x9a,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x08,0x34,0x00,0x09,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00};
		    unsigned int STR_LEN = sizeof(dt);

Serial.println(MODBUS_CRC16_v1(dt,STR_LEN), HEX);
	//flag1=1;
	transmitpacket="2510000000183001b901ba006f007000dd00de014b014c0000000000000000000000000834000900000000000000000000000000000000832fff";
   // byte cmd[9] = {0x2b, 0x00, 0x01, 0x00, 0x01, 0xa1, 0x00, 0x00, 0x7e};

byte CardNumber[]={0x24,0x10,0x00,0x00,0x00,0x18,0x30,0x01,0xb9,0x01,0xba,0x00,0x6f,0x00,0x70,0x00,0xdd,0x00,0xde,0x01,0x4b,0x01,0x4c,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x08,0x34,0x00,0x09,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x28,0x94,0xff};
//int CardNumber[]={6,16,0,0,0,24,48,1,185,1,186,0,111,0,112,0,221,0,222,1,75,1,76,0,0,0,0,0,0,0,0,0,0,0,0,8,52,0,9,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,40,148};
byte CardNumberByte[57];
 for(int i = 0; i < 58; i++)
{
 Serial.print(CardNumber[i],HEX);
}
 Serial.println("");
	 //Serial1.print(transmitpacket);
Serial.write(CardNumber, 58);
Serial1.write(CardNumber, 58);

	return "";
}


void setup(){

  //Hardware Serial of ESP32
  Serial1.begin(9600, SERIAL_8N1, RXD2, TXD2);

  // Serial port for debugging purposes - moved earlier to capture early logs
  Serial.begin(115200);
  delay(100);

  // Initialize LittleFS
  serverlog("Initializing LittleFS...","ln");
  if(!LittleFS.begin(true)){
    serverlog("CRITICAL ERROR: LittleFS mount failed!","ln");
    return;
  }

  // List LittleFS files for debugging
  serverlog("Listing files on LittleFS:","ln");
  File rootDir = LittleFS.open("/");
  while (File fileInfo = rootDir.openNextFile()) {
      serverlog("File: ","");
      serverlog(fileInfo.name(),"");
      serverlog(" - Size: ","");
      serverlog(String(fileInfo.size()),"ln");
  }

  //CONFIG OKU
  WriteLedConfig(String("x"));

  serverlog("System setup continuing...","ln");

  /*if(Serial)
    serverlog("system started","ln");
  else
    devprod="p";  */

  //WIFI BASLAT
  //WiFi.onEvent(OnWiFiEvent);
  initwifi();
  initap();

  //WiFi.setAutoReconnect(false);
  //serverlog("getAutoReconnect:","");
  //serverlog(String(WiFi.getAutoReconnect()),"ln");


  initserver();
	//modbustest();
}

void loop(){

/*---------CHECK WIFI AND POOl SERVER IF apsta---------------*/

if(mode_apsta=="apsta"){


/*---------CHECK WIFI STATUS---------------*/

if ((millis() - cTime_wificonnect >= intv_wificonnect)) {
    cTime_wificonnect=millis();
    serverlog("Checking Wifi status.................","ln");

    if(WiFi.status()!= WL_CONNECTED){
      //WIFI BASLAT
   serverlog("Restart wifi before Pooling Server...","ln");
	//if(wifi_fail_try<2){
		//wifi_fail_try++;
		serverlog("wifi try:","");
		//serverlog((String)wifi_fail_try,"ln");
		initwifi();
	//}
	//else{
		//initap();
		//wifi_fail_try = 0;
	//}
    }
    else{
     serverlog("wifi is already connected.................","ln");
    }
}



/*--------POOL SERVER-------------------*/

if ((millis() - cTime_serverpool >= intv_serverpool)) {
  serverlog((String)millis(),"");
  cTime_serverpool=millis();

   /* if(WiFi.status()!= WL_CONNECTED){
      //WIFI BASLAT
   serverlog("Restart wifi before Pooling Server...","ln");
      initwifi();
    }*/

    if(WiFi.status()== WL_CONNECTED){

  serverlog("WİFİ is up, Pooling Server...","ln");

poolres = "";
poolres = sendhttp("", "httpget", serverName_poolp);
//server change start detected
if(poolres=="1")
{
  cfjres = "";
  String serverName_process1 = serverName_process + "?getcfj=t&sid=" + sid + "&pstart=t";
   cfjres = sendhttp("", "httpget", serverName_process1);
     serverlog("cfj:","ln");
     serverlog(cfjres,"ln");
    if(cfjres!="" && checkncfj()=="1")
    {
      //Save cfj downloaded from server
      FileWriteF(cfjres,"/ledconfig.json");
      //serial process start
	  change_source ='s'; //change made from server
      WriteLedConfig(String("x"));
      if(ptype=="pr") //server cfj price change process
      {
        receivepacket_before = "000000000000000000000000N";
         //SendSerialProcStart();
		 modbustask = 's';
        //Pool result prepare
      }
      else{
          String serverName_process1 = serverName_process + "?procres="+"t"+"&pid=" + pid;
          String receivepacket_res = "{\"res\":\"paramok\"}";
          cfjres = sendhttp(receivepacket_res, "httpjson", serverName_process1);
         }
    }

}

    }
    else {
      serverlog("WiFi Disconnected while pooling","ln");
    }
}

}


/*---------TEST MODBUS SERIAL EVRY 1 SEC---------------*/

if ((millis() - cTime_serverpool >= intv_serverpool)) {
  cTime_serverpool=millis();
   // modbustask = 's';
	//ModbusTaskStart();
}


/*---------RESTART NORMAL---------------*/

if ((millis() - cTime_restartnormal >= intv_restartnormal)) {
    cTime_restartnormal=millis();
    serverlog("Restart Normally..........","ln");

	esprestart();
}


 /*--------SEND SERIAL SIIMULATION---------
  if(millis() - currentTime >= 10000) {
  if (flag1 == 1){
    //currentlyOn=false;
    currentTime=millis(); // Reset timer
    receivepacket = "111000000000000000000000O";
    Serial.println("simulation:" + receivepacket);
    receivepacketsend();
    flag1 = 0;
  }
  }
*/

/*---------SEND SERIAL DATA------------

  if (flag1 == 1)  {
	serverlog("Sendingserials...:","");
	serverlog(transmitpacket,"ln");
    receivepacket = "";
    //webden send butonuna basınca çalışacak kod
    Serial1.println(transmitpacket);
    flag1 = 0;
  }
*/

/*---------CHECK AND SEND MODBUS SERIAL DATA------------*/

if ((millis() - cTime_modbuschecksend >= intv_modbuschecksend) ||  modbustask == 's') {
    cTime_modbuschecksend=millis();
  if (modbustask != 'x')  {
	serverlog("Sendingmodbusserials...:","");
	ModbusTaskStart();
  }
}

/*-------CHECK SERIAL DATA------------*/
/*
  if (Serial1.available()){
   while (Serial1.available() > 0)
  {
       //serverlog("  hmic:","");
       //serverlog((String)Serial1.available(),"");
    // get the new byte:
    int inChar = (int)Serial1.read();
	  Serial.println(inChar,HEX);

    if (inChar == '\n') {
      serverlog("","ln");
      serverlog("hmi:","");
      serverlog(receivepacket2,"ln");
      receivepacket = receivepacket2;

      receivepacket2 = "";
    }
    else
    {
      //serverlog("  hmichar:","");
      //serverlog((String)inChar,"");


      receivepacket2 += inChar;
    }
  }

         //serverlog("receivepacketwoutfilter:","");
         //serverlog(receivepacket,"ln");
		 //receivepacketsend();
  }
*/


}
